StuartJames/LVGL-Cpp/EGL/src/draw/stm32_dma2d/EG_GPU_STM32_DMA2D.cpp
/*
 *                EGL 2025-2026 HydraSystems.
 *
 *  This program is free software; you can redistribute it and/or
 *  modify it under the terms of the GNU General Public License as
 *  published by the Free Software Foundation; either version 2 of
 *  the License, or (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  Based on a design by LVGL Kft
 *
 * =====================================================================
 *
 * Edit     Date     Version       Edit Description
 * ====  ==========  ======= ===========================================
 * SJ    2025/08/18   8.4.0    Original by LVGL Kft
 * SJ    2026/07/20   8.6.0    Modified file layoout & class naming
 *
 */

#include "draw/stm32_dma2d/EG_GPU_STM32_DMA2D.h"
#include "core/EG_Refresh.h"

///////////////////////////////////////////////////////////////////////////////////////

#if EG_USE_GPU_STM32_DMA2D

#if EG_COLOR_16_SWAP
// Note: DMA2D red/blue swap (RBS) works for all color modes
#define RBS_BIT 1U
#else
#define RBS_BIT 0U
#endif

#define CACHE_ROW_SIZE 32U  // cache row size in Bytes

// For code/implementation discussion refer to https://github.com/lvgl/lvgl/issues/3714#issuecomment-1365187036
// astyle --options=lvgl/scripts/code-format.cfg --ignore-exclude-errors lvgl/pSrceBuffer/draw/stm32_dma2d/*.c lvgl/pSrceBuffer/draw/stm32_dma2d/*.h

#if EG_COLOR_DEPTH == 16
const DMA2DColorFormat_e EG2DColorFormat = RGB565;
#elif EG_COLOR_DEPTH == 32
const DMA2DColorFormat_e EG2DColorFormat = ARGB8888;
#else
#error "Cannot use DMA2D with EG_COLOR_DEPTH other than 16 or 32"
#endif

///////////////////////////////////////////////////////////////////////////////////////

bool EGSTM32Context::m_IsDMAInProgess = false;  // indicates whether DMA2D transfer *initiated here* is in progress

///////////////////////////////////////////////////////////////////////////////////////

// Turn on the peripheral and set output color mode, this only needs to be done once
void EGSTM32Context::InitialiseDMA2D(void)
{
// Enable DMA2D clock
#if defined(STM32F4) || defined(STM32F7) || defined(STM32U5)
	RCC->AHB1ENR |= RCC_AHB1ENR_DMA2DEN;  // enable DMA2D
	// wait for hardware access to complete
	__asm volatile("DSB\n");
	volatile uint32_t temp = RCC->AHB1ENR;
	EG_UNUSED(temp);
#elif defined(STM32H7)
	RCC->AHB3ENR |= RCC_AHB3ENR_DMA2DEN;
	// wait for hardware access to complete
	__asm volatile("DSB\n");
	volatile uint32_t temp = RCC->AHB3ENR;
	EG_UNUSED(temp);
#else
#warning "EGL failed to enable the clock of DMA2D"
#endif
	// AHB master timer configuration
	DMA2D->AMTCR = 0;  // AHB bus guaranteed dead time disabled
#if defined(EG_STM32_DMA2D_TEST)
	InitialiseDWT();  // init µs timer
#endif
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::InitialiseContext(void)
{
  EGSoftContext::InitialiseContext();   // call the base class
	BlendProc = Blend;
	DrawImageDecodedProc = DrawImageDecoded;
//  DrawImageProc = DrawImage;
  CopyBufferProc = BufferCopy;
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::Blend(EGBlendBase *pBlend)
{
	if(pBlend->m_BlendMode != EG_BLEND_MODE_NORMAL) {
		EGSoftBlend::BlendBasic(pBlend);
		return;
	}
  EGSTM32Context *pDC = (EGSTM32Context*)pBlend->m_pContext;
	// Note: x1 must be zero. Otherwise, there is no way to correctly calculate DestStep.
	// EG_ASSERT_MSG(m_pDrawRect->x1 == 0); // critical?
	// Both draw buffer start address and buffer size *must* be 32-byte aligned since draw buffer cache is being invalidated.
	// uint32_t drawBufferLength = m_pDrawRect->GetSize() * sizeof(EG_Color_t);
	// EG_ASSERT_MSG(drawBufferLength % CACHE_ROW_SIZE == 0); // critical, but this is not the way to test it
	// EG_ASSERT_MSG((uint32_t)m_pDrawBuffer % CACHE_ROW_SIZE == 0, "draw_ctx.buf is not 32B aligned"); // critical?

	if(pBlend->m_pSourceBuffer != nullptr) {
		// For performance reasons, both source buffer start address and buffer size *should* be 32-byte aligned since source buffer cache is being cleaned.
		// uint32_t srcBufferLength = pBlend->m_pRect->GetSize() * sizeof(EG_Color_t);
		// EG_ASSERT_MSG(srcBufferLength % CACHE_ROW_SIZE == 0); // FIXME: assert fails (performance, non-critical)
		// EG_ASSERT_MSG((uint32_t)pBlend->m_pSourceBuffer % CACHE_ROW_SIZE == 0); // FIXME: assert fails (performance, non-critical)
	}

	EGRect DrawRect;
	if(!DrawRect.Intersect(pBlend->m_pRect, pDC->m_pClipRect)) return;
	// + m_pDrawRect has the entire draw buffer location
	// + draw_ctx->clip_area has the current draw buffer location
	// + pBlend->m_pRect has the location of the area intended to be painted - image etc.
	// + DrawRect has the area actually being painted
	// All coordinates are relative to the screen.

	const EG_OPA_t *pMask = pBlend->m_pMaskBuffer;
	if(pBlend->m_pMaskBuffer && pBlend->m_MaskResult == EG_DRAW_MASK_RESULT_TRANSP) return;
	else if(pBlend->m_MaskResult == EG_DRAW_MASK_RESULT_FULL_COVER)	pMask = nullptr;
	int32_t DestStep = pDC->m_pDrawRect->GetWidth();
	if(pMask != nullptr) {
		// For performance reasons, both mask buffer start address and buffer size *should* be 32-byte aligned since mask buffer cache is being cleaned.
		// uint32_t srcBufferLength = pBlend->m_pMaskRect->GetSize() * sizeof(EG_OPA_t);
		// EG_ASSERT_MSG(srcBufferLength % CACHE_ROW_SIZE == 0); // FIXME: assert fails (performance, non-critical)
		// EG_ASSERT_MSG((uint32_t)pMask % CACHE_ROW_SIZE == 0); // FIXME: assert fails (performance, non-critical)
		int32_t MaskStep = pBlend->m_pMaskRect->GetWidth();
		EGPoint MaskOffset = pBlend->m_pMaskRect->GetOffset(&DrawRect);  // mask offset in relation to DrawRect
		if(pBlend->m_pSourceBuffer == nullptr) {  // 93.5%
			DrawRect.Move(-pDC->m_pDrawRect->GetX1(), -pDC->m_pDrawRect->GetY1());
			pDC->BlendPaint((EG_Color_t*)pDC->m_pDrawBuffer, DestStep, &DrawRect, pMask, MaskStep, &MaskOffset, pBlend->m_Color, pBlend->m_OPA);
		}
		else {  // 0.2%
						// note: (x)RGB pBlend->m_pSourceBuffer does not carry alpha channel bytes,
						// alpha channel bytes are carried in pBlend->m_pMaskBuffer
#if EG_COLOR_DEPTH == 32
			int32_t SrceStep = pBlend->m_pRect->GetWidth();
			EGPoint SrceOffset = pBlend->m_pRect->GetOffset( &DrawRect);  // source image offset in relation to DrawRect
			int32_t DrawWidth = DrawRect.GetWidth();
			int32_t DrawHeight = DrawRect.GetHeight();
			// merge mask alpha bytes with pSrceBuffer RGB bytes
			// TODO: optimize by reading 4 or 8 mask bytes at a time
			pMask += (MaskStep * MaskOffset.y) + MaskOffset.x;
			EG_Color_t *pSourceBuffer = (EG_Color_t *)pBlend->m_pSourceBuffer;
			pSourceBuffer += (SrceStep * SrceOffset.y) + SrceOffset.x;
			uint16_t mask_buffer_offset = MaskStep - DrawWidth;
			uint16_t src_buffer_offset = SrceStep - DrawWidth;
			while(DrawHeight > 0) {
				DrawHeight--;
				for(uint16_t x = 0; x < DrawWidth; x++) {
					(*pSourceBuffer).ch.alpha = *pMask;
					pSourceBuffer++;
					pMask++;
				}
				pMask += mask_buffer_offset;
				pSourceBuffer += src_buffer_offset;
			}
			DrawRect.Move(-m_pDrawRect->GetX1(), -m_pDrawRect->GetY1());  // translate the screen draw area to the origin of the buffer area
			BlendMap((EG_Color_t*)m_pDrawBuffer, DestStep, &DrawRect, pBlend->m_pSourceBuffer, SrceStep, &SrceOffset, pBlend->m_OPA, ARGB8888, false);
#else
			// Note: 16-bit bitmap hardware blending with mask and background is possible, but requires a temp 24 or 32-bit buffer to combine bitmap with mask first.
			EGSoftBlend::BlendBasic(pBlend);  // (e.g. Shop Items)
// clean cache after software drawing - this does not help since this is not the only place where buffer is written without dma2d
// int32_t DrawWidth = DrawRect.GetWidth();
// int32_t DrawHeight = DrawRect.GetHeight();
// uint32_t dest_address = (uint32_t)(m_pDrawBuffer + (DestStep * DrawRect.y1) + DrawRect.x1);
// EGSTM32Context::CleanCache(dest_address, DestStep - DrawWidth, DrawWidth, DrawHeight, sizeof(EG_Color_t));
#endif
		}
	}
	else {
		if(pBlend->m_pSourceBuffer == nullptr) {  // 6.1%
			DrawRect.Move(-pDC->m_pDrawRect->GetX1(), -pDC->m_pDrawRect->GetY1());  // translate the screen draw area to the origin of the buffer area
			pDC->BlendFill((EG_Color_t*)pDC->m_pDrawBuffer, DestStep, &DrawRect, pBlend->m_Color, pBlend->m_OPA);
		}
		else {  // 0.2%
			int32_t SrceStep = pBlend->m_pRect->GetWidth();
			EGPoint SrceOffset = pBlend->m_pRect->GetOffset(&DrawRect);  // source image offset in relation to DrawRect
			DrawRect.Move(-pDC->m_pDrawRect->GetX1(), -pDC->m_pDrawRect->GetY1());  // translate the screen draw area to the origin of the buffer area
			pDC->BlendMap((EG_Color_t*)pDC->m_pDrawBuffer, DestStep, &DrawRect, pBlend->m_pSourceBuffer, SrceStep, &SrceOffset, pBlend->m_OPA, EG2DColorFormat, true);
		}
	}
}

