StuartJames/LVGL-Cpp/EGL/src/draw/stm32_dma2d/EG_GPU_STM32_DMA2D.cpp
///////////////////////////////////////////////////////////////////////////////////////

// See: https://github.com/lvgl/lvgl/issues/3714#issuecomment-1331710788
void EGSTM32Context::BufferCopy(void *pDestBuffer, int32_t DestStep, EGRect *pDestRect, void *pSrceBuffer, int32_t SrceStep, EGRect *pSrceRect)
{
	// Both draw buffer start address and buffer size *must* be 32-byte aligned since draw buffer cache is being invalidated.
	// uint32_t drawBufferLength = m_pDrawRect->GetSize() * sizeof(EG_Color_t);
	// EG_ASSERT_MSG(drawBufferLength % CACHE_ROW_SIZE == 0); // critical, but this is not the way to test it
	// EG_ASSERT_MSG((uint32_t)m_pDrawBuffer % CACHE_ROW_SIZE == 0, "draw_ctx.buf is not 32B aligned"); // critical?
	// FIXME:
	// 1. Both pSourceBuffer and pDestBuffer pixel size *must* be known to use DMA2D.
	// 2. Verify both buffers start addresses and lengths are 32-byte (cache row size) aligned.
	EGPoint SrceOffset = pSrceRect->GetOffset(pDestRect);
	// FIXME: use pDestRect->Move(-dest_area->x1, -dest_area->y1) here ?
	// TODO: It is assumed that pDestBuffer and pSourceBuffer buffers are of EG_Color_t type. Verify it, this assumption may be incorrect.
	BlendMap((const EG_Color_t *)pDestBuffer, DestStep, pDestRect, (const EG_Color_t *)pSrceBuffer, SrceStep, &SrceOffset, 0xff, EG2DColorFormat, true);
	// TODO: Investigate if output buffer cache needs to be invalidated. It depends on what the destination buffer is and how it is used next - by dma2d or not.
	WaitTransferFinish(nullptr);  // TODO: is this line needed here?
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::DrawImageDecoded(const EGDrawImage *pDrawImage, const EGRect *pRect, const uint8_t *pSourceBuffer, EG_ImageColorFormat_t ColorFormat)
{
  EGSTM32Context *pDC = (EGSTM32Context*)pDrawImage->m_pContext;
  EGRect DrawRect(pDC->m_pClipRect);
  bool HasMask = HasAnyDrawMask(pDC->m_pDrawRect);
  bool Transform = ((pDrawImage->m_Angle != 0) || pDrawImage->m_Scale.IsScaled());
	const DMA2DColorFormat_e BitmapColorFormat = ColorToDMA2dColor(ColorFormat);
	const bool IgnoreAlpha = (ColorFormat == EG_COLOR_FORMAT_RGBX8888);
	if(!HasMask && !Transform && BitmapColorFormat != UNSUPPORTED && pDrawImage->m_RecolorOPA == EG_OPA_TRANSP) {
		// simple bitmap blending, optionally with supported color format conversion - handle directly by dma2d
		int32_t DestStep = pDC->m_pDrawRect->GetWidth();
		int32_t SrceStep = pRect->GetWidth();
		EGPoint SrceOffset = pRect->GetOffset(&DrawRect);  // source image offset in relation to DrawRect
		DrawRect.Move(-pDC->m_pDrawRect->GetX1(), -pDC->m_pDrawRect->GetY1());
		pDC->BlendMap((EG_Color_t*)pDC->m_pDrawBuffer, DestStep, &DrawRect, pSourceBuffer, SrceStep, &SrceOffset, pDrawImage->m_OPA, BitmapColorFormat, IgnoreAlpha);
	}
	else {
		// the rest are complex cases which require additional image transformations
		EGSoftContext::DrawImageDecoded(pDrawImage, pRect, pSourceBuffer, ColorFormat);
	}
}

///////////////////////////////////////////////////////////////////////////////////////

DMA2DColorFormat_e EGSTM32Context::ColorToDMA2dColor(EG_ImageColorFormat_t ColorFormat)
{
	switch(ColorFormat) {
		case EG_COLOR_FORMAT_RGBA8888:			// note: EG_COLOR_FORMAT_RGBA8888 is actually ARGB8888
			return ARGB8888;
		case EG_COLOR_FORMAT_RGBX8888:			// note: EG_IMG_CF_RGBX8888 is actually XRGB8888
			return ARGB8888;
		case EG_COLOR_FORMAT_RGB565:
			return RGB565;
		case EG_COLOR_FORMAT_NATIVE:
			return EG2DColorFormat;
		case EG_COLOR_FORMAT_NATIVE_ALPHA:
#if EG_COLOR_DEPTH == 16
			// bitmap color format is 24b ARGB8565 - dma2d unsupported
			return UNSUPPORTED;
#elif EG_COLOR_DEPTH == 32
			return ARGB8888;
#else
			// unknown bitmap color format
			return UNSUPPORTED;
#endif
		default:
			return UNSUPPORTED;
	}
}

///////////////////////////////////////////////////////////////////////////////////////

EG_Result_t EGSTM32Context::DrawImage(const EGDrawImage *pDrawImage, const EGRect *pSrceRect, const void *pSrceBuffer)
{
	//if(pSrceBuffer->GetType() != EG_IMG_SRC_VARIABLE) return EG_RES_INVALID;
	return EG_RES_INVALID;
	if(pDrawImage->m_OPA <= EG_OPA_MIN) return EG_RES_OK;
  EGSTM32Context *pDC = (EGSTM32Context*)pDrawImage->m_pContext;
	const EGImageBuffer *pImage = (EGImageBuffer*)pSrceBuffer;
	const DMA2DColorFormat_e BitmapColorFormat = ColorToDMA2dColor((EG_ImageColorFormat_t)pImage->m_Header.ColorFormat);
	const bool IgnoreBitmapAlpha = (pImage->m_Header.ColorFormat == EG_COLOR_FORMAT_RGBX8888);
	if(BitmapColorFormat == UNSUPPORTED || pDrawImage->m_Angle != 0 || pDrawImage->m_Scale.IsScaled()) {
		return EG_RES_INVALID;  // sorry, dma2d can handle this
	}

	// FIXME: handle dsc.pivot, dsc.recolor, dsc.blend_mode
	// FIXME: pSrceBuffer pixel size *must* be known to use DMA2D
	// FIXME: If image is drawn by SW, then output cache needs to be cleaned next. Currently it is not possible.
	// Both draw buffer start address and buffer size *must* be 32-byte aligned since draw buffer cache is being invalidated.
	//uint32_t drawBufferLength = m_pDrawRect->GetSize() * sizeof(EG_Color_t);
	//EG_ASSERT_MSG(drawBufferLength % CACHE_ROW_SIZE == 0); // critical, but this is not the way to test it
	//EG_ASSERT_MSG((uint32_t)m_pDrawBuffer % CACHE_ROW_SIZE == 0, "draw_ctx.buf is not 32B aligned"); // critical?

	// For performance reasons, both source buffer start address and buffer size *should* be 32-byte aligned since source buffer cache is being cleaned.
	//uint32_t srcBufferLength = lv_area_get_size(src_area) * sizeof(EG_Color_t); // TODO: verify pSrceBuffer pixel size = sizeof(EG_Color_t)
	//EG_ASSERT_MSG(srcBufferLength % CACHE_ROW_SIZE == 0); // FIXME: assert fails (performance, non-critical)
	//EG_ASSERT_MSG((uint32_t)pSrceBuffer % CACHE_ROW_SIZE == 0); // FIXME: assert fails (performance, non-critical)

	EGRect DrawRect;
	if(!DrawRect.Intersect(pSrceRect, pDC->m_pClipRect)) return EG_RES_OK;
	int32_t DestStep = pDC->m_pDrawRect->GetWidth();
	EGPoint SrceOffset = pSrceRect->GetOffset(&DrawRect);  // source image offset in relation to DrawRect
	DrawRect.Move(-pDC->m_pDrawRect->GetX1(), -pDC->m_pDrawRect->GetY1());
	pDC->BlendMap((EG_Color_t*)pDC->m_pDrawBuffer, DestStep, &DrawRect, pImage->m_pData, pImage->m_Header.Width, &SrceOffset, pDrawImage->m_OPA, BitmapColorFormat, IgnoreBitmapAlpha);
	return EG_RES_OK;
}

