StuartJames/LVGL-Cpp/EGL/src/draw/stm32_dma2d/EG_GPU_STM32_DMA2D.cpp
///////////////////////////////////////////////////////////////////////////////////////

// Fills DrawRect with specified color.
void EGSTM32Context::BlendFill(const EG_Color_t *pDestBuffer, int32_t DestStep, const EGRect *pDrawRect, EG_Color_t Color, EG_OPA_t OPA)
{
	EG_ASSERT_MSG(!m_IsDMAInProgess, "dma2d transfer has not finished");  // critical
	int32_t DrawWidth = pDrawRect->GetWidth();
	int32_t DrawHeight = pDrawRect->GetHeight();
	WaitTransferFinish(nullptr);
	if(OPA >= EG_OPA_MAX) {
		DMA2D->CR = 0x3UL << DMA2D_CR_MODE_Pos;  // Register-to-memory (no FG nor BG, only output stage active)
		DMA2D->OPFCCR = EG2DColorFormat;
#if defined(DMA2D_OPFCCR_RBS_Pos)
		DMA2D->OPFCCR |= (RBS_BIT << DMA2D_OPFCCR_RBS_Pos);
#endif
		DMA2D->OMAR = (uint32_t)(pDestBuffer + (DestStep * pDrawRect->GetY1()) + pDrawRect->GetX1());
		DMA2D->OOR = DestStep - DrawWidth;  // out buffer offset
// Note: unlike FGCOLR and BGCOLR, OCOLR bits must match DMA2D_OUTPUT_COLOR, alpha can be specified
#if RBS_BIT		// swap red/blue bits
		DMA2D->OCOLR = (Color.ch.blue << 11) | (Color.ch.green_l << 5 | Color.ch.green_h << 8) | (Color.ch.red);
#else
		DMA2D->OCOLR = Color.full;
#endif
	}
	else {
		DMA2D->CR = 0x2UL << DMA2D_CR_MODE_Pos;  // Memory-to-memory with blending (FG and BG fetch with PFC and blending)

		DMA2D->FGPFCCR = A8;
		DMA2D->FGPFCCR |= (OPA << DMA2D_FGPFCCR_ALPHA_Pos);
		// Alpha Mode 1: Replace original foreground image alpha channel value by FGPFCCR.ALPHA
		DMA2D->FGPFCCR |= (0x1UL << DMA2D_FGPFCCR_AM_Pos);
		//DMA2D->FGPFCCR |= (RBS_BIT << DMA2D_FGPFCCR_RBS_Pos);

		// Note: in Alpha Mode 1 FGMAR and FGOR are not used to supply foreground A8 bytes,
		// those bytes are replaced by constant ALPHA defined in FGPFCCR
		DMA2D->FGMAR = (uint32_t)pDestBuffer;
		DMA2D->FGOR = DestStep;
		DMA2D->FGCOLR = EG_ColorTo32(Color) & 0x00ffffff;  // swap FGCOLR R/B bits if FGPFCCR.RBS (RBS_BIT) bit is set

		DMA2D->BGPFCCR = EG2DColorFormat;
#if defined(DMA2D_BGPFCCR_RBS_Pos)
		DMA2D->BGPFCCR |= (RBS_BIT << DMA2D_BGPFCCR_RBS_Pos);
#endif
		DMA2D->BGMAR = (uint32_t)(pDestBuffer + (DestStep * pDrawRect->GetY1()) + pDrawRect->GetX1());
		DMA2D->BGOR = DestStep - DrawWidth;
		DMA2D->BGCOLR = 0;  // used in A4 and A8 modes only
		CleanCache(DMA2D->BGMAR, DMA2D->BGOR, DrawWidth, DrawHeight, sizeof(EG_Color_t));
		DMA2D->OPFCCR = EG2DColorFormat;
#if defined(DMA2D_OPFCCR_RBS_Pos)
		DMA2D->OPFCCR |= (RBS_BIT << DMA2D_OPFCCR_RBS_Pos);
#endif
		DMA2D->OMAR = DMA2D->BGMAR;
		DMA2D->OOR = DMA2D->BGOR;
		DMA2D->OCOLR = 0;
	}
	// PL - pixel per lines (14 bit), NL - number of lines (16 bit)
	DMA2D->NLR = (DrawWidth << DMA2D_NLR_PL_Pos) | (DrawHeight << DMA2D_NLR_NL_Pos);
	StartTransfer();
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::BlendMap(const EG_Color_t *pDestBuffer, int32_t DestStep, const EGRect *pDrawRect, const void *pSrceBuffer, int32_t SrceStep,
  const EGPoint *pSrceOffset, EG_OPA_t OPA, DMA2DColorFormat_e SrceCF, bool IgnoreSrceAlpha)
{
	EG_ASSERT_MSG(!m_IsDMAInProgess, "dma2d transfer has not finished");  // critical
	if(OPA <= EG_OPA_MIN || SrceCF == UNSUPPORTED) return;
	int32_t DrawWidth = pDrawRect->GetWidth();
	int32_t DrawHeight = pDrawRect->GetHeight();
	bool BitmapHasOpacity = !IgnoreSrceAlpha && (SrceCF == ARGB8888 || SrceCF == ARGB1555 || SrceCF == ARGB4444);
	if(OPA >= EG_OPA_MAX) OPA = 0xff;
	uint8_t SrceBpp;  // source bytes per pixel
	switch(SrceCF) {
		case ARGB8888:
			SrceBpp = 4;
			break;
		case RGB888:
			SrceBpp = 3;
			break;
		case RGB565:
		case ARGB1555:
		case ARGB4444:
			SrceBpp = 2;
			break;
		default:
			EG_LOG_ERROR("unsupported color format");
			return;
	}
	WaitTransferFinish(nullptr);
	DMA2D->FGPFCCR = SrceCF;
	if(OPA == 0xff && !BitmapHasOpacity) {		// no need to blend
		if(SrceCF == EG2DColorFormat) {     			// no need to convert pixel format (PFC) either
			DMA2D->CR = 0x0UL;
		}
		else {
			DMA2D->CR = 0x1UL << DMA2D_CR_MODE_Pos;  // Memory-to-memory with PFC (FG fetch only with FG PFC active)
		}
		// Alpha Mode 0: No modification of the foreground image alpha channel value
	}
	else {
		// blend
		DMA2D->CR = 0x2UL << DMA2D_CR_MODE_Pos;  // Memory-to-memory with blending (FG and BG fetch with PFC and blending)
		DMA2D->FGPFCCR |= (OPA << DMA2D_FGPFCCR_ALPHA_Pos);
		if(BitmapHasOpacity) {
			// Alpha Mode 2: Replace original foreground image alpha channel value by FGPFCCR.ALPHA multiplied with original alpha channel value
			DMA2D->FGPFCCR |= (0x2UL << DMA2D_FGPFCCR_AM_Pos);
		}
		else {
			// Alpha Mode 1: Replace original foreground image alpha channel value by FGPFCCR.ALPHA
			DMA2D->FGPFCCR |= (0x1UL << DMA2D_FGPFCCR_AM_Pos);
		}
	}
#if defined(DMA2D_FGPFCCR_RBS_Pos)
	DMA2D->FGPFCCR |= (RBS_BIT << DMA2D_FGPFCCR_RBS_Pos);
#endif
	DMA2D->FGMAR = ((uint32_t)pSrceBuffer) + SrceBpp * ((SrceStep * pSrceOffset->m_Y) + pSrceOffset->m_X);
	DMA2D->FGOR = SrceStep - DrawWidth;
	DMA2D->FGCOLR = 0;  // used in A4 and A8 modes only
	CleanCache(DMA2D->FGMAR, DMA2D->FGOR, DrawWidth, DrawHeight, SrceBpp);
	DMA2D->OPFCCR = EG2DColorFormat;
#if defined(DMA2D_OPFCCR_RBS_Pos)
	DMA2D->OPFCCR |= (RBS_BIT << DMA2D_OPFCCR_RBS_Pos);
#endif
	DMA2D->OMAR = (uint32_t)(pDestBuffer + (DestStep * pDrawRect->GetY1()) + pDrawRect->GetX1());
	DMA2D->OOR = DestStep - DrawWidth;
	DMA2D->OCOLR = 0;
	if(OPA != 0xff || BitmapHasOpacity) {
		// use background (BG*) registers
		DMA2D->BGPFCCR = EG2DColorFormat;
#if defined(DMA2D_BGPFCCR_RBS_Pos)
		DMA2D->BGPFCCR |= (RBS_BIT << DMA2D_BGPFCCR_RBS_Pos);
#endif
		DMA2D->BGMAR = DMA2D->OMAR;
		DMA2D->BGOR = DMA2D->OOR;
		DMA2D->BGCOLR = 0;  // used in A4 and A8 modes only
		CleanCache(DMA2D->BGMAR, DMA2D->BGOR, DrawWidth, DrawHeight, sizeof(EG_Color_t));
	}
	// PL - pixel per lines (14 bit), NL - number of lines (16 bit)
	DMA2D->NLR = (DrawWidth << DMA2D_NLR_PL_Pos) | (DrawHeight << DMA2D_NLR_NL_Pos);
	StartTransfer();
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::BlendPaint(const EG_Color_t *pDestBuffer, int32_t DestStep, const EGRect *pDrawRect, const EG_OPA_t *pMaskBuffer,
  int32_t MaskStep, const EGPoint *pMaskOffset, EG_Color_t Color, EG_OPA_t OPA)
{
	EG_ASSERT_MSG(!m_IsDMAInProgess, "dma2d transfer has not finished");  // critical
	int32_t DrawWidth = pDrawRect->GetWidth();
	int32_t DrawHeight = pDrawRect->GetHeight();
	WaitTransferFinish(nullptr);
	DMA2D->CR = 0x2UL << DMA2D_CR_MODE_Pos;  // Memory-to-memory with blending (FG and BG fetch with PFC and blending)
	DMA2D->FGPFCCR = A8;
	if(OPA < EG_OPA_MAX) {
		DMA2D->FGPFCCR |= (OPA << DMA2D_FGPFCCR_ALPHA_Pos);
		DMA2D->FGPFCCR |= (0x2UL << DMA2D_FGPFCCR_AM_Pos);  // Alpha Mode: Replace original foreground image alpha channel value by FGPFCCR.ALPHA multiplied with original alpha channel value
	}
	//DMA2D->FGPFCCR |= (RBS_BIT << DMA2D_FGPFCCR_RBS_Pos);
	DMA2D->FGMAR = (uint32_t)(pMaskBuffer + (MaskStep * pMaskOffset->m_Y) + pMaskOffset->m_X);
	DMA2D->FGOR = MaskStep - DrawWidth;
	DMA2D->FGCOLR = EG_ColorTo32(Color) & 0x00ffffff;  // swap FGCOLR R/B bits if FGPFCCR.RBS (RBS_BIT) bit is set
	CleanCache(DMA2D->FGMAR, DMA2D->FGOR, DrawWidth, DrawHeight, sizeof(EG_OPA_t));
	DMA2D->BGPFCCR = EG2DColorFormat;
#if defined(DMA2D_BGPFCCR_RBS_Pos)
	DMA2D->BGPFCCR |= (RBS_BIT << DMA2D_BGPFCCR_RBS_Pos);
#endif
	DMA2D->BGMAR = (uint32_t)(pDestBuffer + (DestStep * pDrawRect->GetY1()) + pDrawRect->GetX1());
	DMA2D->BGOR = DestStep - DrawWidth;
	DMA2D->BGCOLR = 0;  // used in A4 and A8 modes only
	CleanCache(DMA2D->BGMAR, DMA2D->BGOR, DrawWidth, DrawHeight, sizeof(EG_Color_t));
	DMA2D->OPFCCR = EG2DColorFormat;
#if defined(DMA2D_OPFCCR_RBS_Pos)
	DMA2D->OPFCCR |= (RBS_BIT << DMA2D_OPFCCR_RBS_Pos);
#endif
	DMA2D->OMAR = DMA2D->BGMAR;
	DMA2D->OOR = DMA2D->BGOR;
	DMA2D->OCOLR = 0;
	// PL - pixel per lines (14 bit), NL - number of lines (16 bit)
	DMA2D->NLR = (DrawWidth << DMA2D_NLR_PL_Pos) | (DrawHeight << DMA2D_NLR_NL_Pos);
	StartTransfer();
}

