StuartJames/LVGL-Cpp/EGL/src/draw/stm32_dma2d/EG_GPU_STM32_DMA2D.cpp
///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::CopyBuffer(EG_Color_t *pDestBuffer, int32_t DestStep, EGRect *pDestRect, EG_Color_t *pSourceBuffer, int32_t SourceStep, EGPoint *pSourceOffset)
{
	EG_ASSERT_MSG(!m_IsDMAInProgess, "dma2d transfer has not finished");  // critical
	int32_t DrawWidth = pDestRect->GetWidth();
	int32_t DrawHeight = pDestRect->GetHeight();

	WaitTransferFinish(nullptr);

	DMA2D->CR = 0x0UL;  // Memory-to-memory (FG fetch only)

	DMA2D->FGPFCCR = EG2DColorFormat;
#if defined(DMA2D_FGPFCCR_RBS_Pos)
	DMA2D->FGPFCCR |= (RBS_BIT << DMA2D_FGPFCCR_RBS_Pos);
#endif
	DMA2D->FGMAR = (uint32_t)(pSourceBuffer + (SourceStep * pSourceOffset->m_Y) + pSourceOffset->m_X);
	DMA2D->FGOR = SourceStep - DrawWidth;
	DMA2D->FGCOLR = 0;  // used in A4 and A8 modes only
	CleanCache(DMA2D->FGMAR, DMA2D->FGOR, DrawWidth, DrawHeight, sizeof(EG_Color_t));
	// Note BG* registers do not need to be set up since BG is not used
	DMA2D->OPFCCR = EG2DColorFormat;
#if defined(DMA2D_OPFCCR_RBS_Pos)
	DMA2D->OPFCCR |= (RBS_BIT << DMA2D_OPFCCR_RBS_Pos);
#endif
	DMA2D->OMAR = (uint32_t)(pDestBuffer + (DestStep * pDestRect->GetY1()) + pDestRect->GetX1());
	DMA2D->OOR = DestStep - DrawWidth;
	DMA2D->OCOLR = 0;
	// PL - pixel per lines (14 bit), NL - number of lines (16 bit)
	DMA2D->NLR = (DrawWidth << DMA2D_NLR_PL_Pos) | (DrawHeight << DMA2D_NLR_NL_Pos);
	StartTransfer();
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::StartTransfer(void)
{
	EG_ASSERT_MSG(!m_IsDMAInProgess, "dma2d transfer has not finished");
	m_IsDMAInProgess = true;
	DMA2D->IFCR = 0x3FU;  // trigger ISR flags reset
												// Note: cleaning output buffer cache is needed only when buffer may be misaligned or adjacent area may have been drawn in sw-fashion, e.g. using lv_draw_sw_blend_basic()
#if EG_COLOR_DEPTH == 16
  CleanCache(DMA2D->OMAR, DMA2D->OOR, (DMA2D->NLR & DMA2D_NLR_PL_Msk) >> DMA2D_NLR_PL_Pos,
																	 (DMA2D->NLR & DMA2D_NLR_NL_Msk) >> DMA2D_NLR_NL_Pos, sizeof(EG_Color_t));
#endif
	DMA2D->CR |= DMA2D_CR_START;
	// Note: for some reason mask buffer gets damaged during transfer if waiting is postponed
	WaitTransferFinish(nullptr);  // FIXME: this line should not be needed here, but it is
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::WaitTransferFinish(EGDisplayDriver *pDriver)
{
	if(pDriver && pDriver->WaitCB) {
		while((DMA2D->CR & DMA2D_CR_START) != 0U) {
			pDriver->WaitCB(pDriver);
		}
	}
	else {
		while((DMA2D->CR & DMA2D_CR_START) != 0U);
	}
	__IO uint32_t isrFlags = DMA2D->ISR;
	if(isrFlags & DMA2D_ISR_CEIF) {
		EG_LOG_ERROR("DMA2D config error");
	}

	if(isrFlags & DMA2D_ISR_TEIF) {
		EG_LOG_ERROR("DMA2D transfer error");
	}
	DMA2D->IFCR = 0x3FU;  // trigger ISR flags reset
	if(m_IsDMAInProgess) {
		// invalidate output buffer cached memory ONLY after DMA2D transfer
		//EGSTM32Context:: CleanCache(DMA2D->OMAR, DMA2D->OOR, (DMA2D->NLR & DMA2D_NLR_PL_Msk) >> DMA2D_NLR_PL_Pos, (DMA2D->NLR & DMA2D_NLR_NL_Msk) >> DMA2D_NLR_NL_Pos, sizeof(EG_Color_t));
		m_IsDMAInProgess = false;
	}
}

///////////////////////////////////////////////////////////////////////////////////////

// Cortex-M7 DCache present
void EGSTM32Context::InvalidateCache(uint32_t Address, int32_t Offset, int32_t Width, int32_t Height, uint8_t PixelSize)
{
#if defined(EG_STM32_DMA2D_USE_M7_CACHE)
	if(((SCB->CCR) & SCB_CCR_DC_Msk) == 0) return;    // L1 data cache is disabled
	uint16_t Step = PixelSize * (Width + Offset);  // in bytes
	uint16_t ll = PixelSize * Width;                 // line length in bytes
	uint32_t n = 0;                                   // address of the next cache row after the last invalidated row
	int32_t h = 0;
	__DSB();
	while(h < Height) {
		uint32_t a = Address + (h * Step);
		uint32_t e = a + ll;  // end address, address of the first byte after the current line
		a &= ~(CACHE_ROW_SIZE - 1U);
		if(a < n) a = n;  // prevent the previous last cache row from being invalidated again
		while(a < e) {
			SCB->DCIMVAC = a;
			a += CACHE_ROW_SIZE;
		}
		n = a;
		h++;
	};
	__DSB();
	__ISB();
#endif
}

///////////////////////////////////////////////////////////////////////////////////////

void EGSTM32Context::CleanCache(uint32_t Address, int32_t Offset, int32_t Width, int32_t Height, uint8_t PixelSize)
{
#if defined(EG_STM32_DMA2D_USE_M7_CACHE)
	if(((SCB->CCR) & SCB_CCR_DC_Msk) == 0) return;    // L1 data cache is disabled
	uint16_t Step = PixelSize * (Width + Offset);  // in bytes
	uint16_t ll = PixelSize * Width;                 // line length in bytes
	uint32_t n = 0;                                   // address of the next cache row after the last cleaned row
	int32_t h = 0;
	__DSB();
	while(h < Height) {
		uint32_t a = Address + (h * Step);
		uint32_t e = a + ll;  // end address, address of the first byte after the current line
		a &= ~(CACHE_ROW_SIZE - 1U);
		if(a < n) a = n;  // prevent the previous last cache row from being cleaned again
		while(a < e) {
			SCB->DCCMVAC = a;
			a += CACHE_ROW_SIZE;
		}
		n = a;
		h++;
	};
	__DSB();
	__ISB();
#endif
}

///////////////////////////////////////////////////////////////////////////////////////

#if defined(EG_STM32_DMA2D_TEST)
// initialize µs timer
bool EGSTM32Context::InitialiseDWT(void)
{
	CoreDebug->DEMCR &= ~CoreDebug_DEMCR_TRCENA_Msk;	// disable TRC
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;	// enable TRC

#if defined(__CORTEX_M) && (__CORTEX_M == 7U)
	DWT->LAR = 0xC5ACCE55;
#endif
	DWT->CTRL &= ~DWT_CTRL_CYCCNTENA_Msk;	// disable clock cycle counter
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;	// enable  clock cycle counter
	DWT->CYCCNT = 0;	// reset the clock cycle counter value
	__ASM volatile("NOP");	// 3 NO OPERATION instructions
	__ASM volatile("NOP");
	__ASM volatile("NOP");
	if(DWT->CYCCNT) {    // check if clock cycle counter has started
		return true;  // clock cycle counter started
	}
	else {
		return false;  // clock cycle counter not started
	}
}

///////////////////////////////////////////////////////////////////////////////////////

// get elapsed µs since reset
uint32_t EGSTM32Context::GetDWT_us(void)
{
	uint32_t us = (DWT->CYCCNT * 1000000) / HAL_RCC_GetHCLKFreq();
	return us;
}

///////////////////////////////////////////////////////////////////////////////////////

// reset µs timer
void EGSTM32Context::ResetDWT(void)
{
	DWT->CYCCNT = 0;
}
#endif
#endif
